###################################################################

# Created by write_sdc on Thu Oct 14 22:14:19 2021

###################################################################
set sdc_version 1.5

set_load -pin_load 1 [get_ports {gray_addr_qtr[3]}]
set_load -pin_load 1 [get_ports {gray_addr_qtr[2]}]
set_load -pin_load 1 [get_ports {gray_addr_qtr[1]}]
set_load -pin_load 1 [get_ports {gray_addr_qtr[0]}]
set_load -pin_load 1 [get_ports gray_req]
set_load -pin_load 1 [get_ports {lbp_addr_qtr[3]}]
set_load -pin_load 1 [get_ports {lbp_addr_qtr[2]}]
set_load -pin_load 1 [get_ports {lbp_addr_qtr[1]}]
set_load -pin_load 1 [get_ports {lbp_addr_qtr[0]}]
set_load -pin_load 1 [get_ports lbp_valid]
set_load -pin_load 1 [get_ports {lbp_data_qtr[1]}]
set_load -pin_load 1 [get_ports {lbp_data_qtr[0]}]
set_load -pin_load 1 [get_ports finish]
create_clock [get_ports clk]  -period 8  -waveform {4 8}
set_clock_latency 1  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -min 0.2  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[3]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[3]}]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[6]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[6]}]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[5]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[5]}]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[0]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[0]}]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[2]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[2]}]
set_input_delay -clock clk  -max 1  [get_ports reset]
set_input_delay -clock clk  -min 0.2  [get_ports reset]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[1]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[1]}]
set_input_delay -clock clk  -max 1  [get_ports gray_ready]
set_input_delay -clock clk  -min 0.2  [get_ports gray_ready]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[7]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[7]}]
set_input_delay -clock clk  -max 1  [get_ports {gray_data[4]}]
set_input_delay -clock clk  -min 0.2  [get_ports {gray_data[4]}]
set_output_delay -clock clk  -max 1  [get_ports lbp_valid]
set_output_delay -clock clk  -min 0.1  [get_ports lbp_valid]
set_output_delay -clock clk  -max 1  [get_ports {lbp_addr_qtr[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_addr_qtr[2]}]
set_output_delay -clock clk  -max 1  [get_ports finish]
set_output_delay -clock clk  -min 0.1  [get_ports finish]
set_output_delay -clock clk  -max 1  [get_ports {lbp_addr_qtr[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_addr_qtr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {lbp_addr_qtr[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_addr_qtr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {gray_addr_qtr[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {gray_addr_qtr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {lbp_addr_qtr[3]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_addr_qtr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {lbp_data_qtr[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_data_qtr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {gray_addr_qtr[0]}]
set_output_delay -clock clk  -min 0.1  [get_ports {gray_addr_qtr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {lbp_data_qtr[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {lbp_data_qtr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {gray_addr_qtr[2]}]
set_output_delay -clock clk  -min 0.1  [get_ports {gray_addr_qtr[2]}]
set_output_delay -clock clk  -max 1  [get_ports gray_req]
set_output_delay -clock clk  -min 0.1  [get_ports gray_req]
set_output_delay -clock clk  -max 1  [get_ports {gray_addr_qtr[1]}]
set_output_delay -clock clk  -min 0.1  [get_ports {gray_addr_qtr[1]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports gray_ready]
set_drive 1  [get_ports {gray_data[7]}]
set_drive 1  [get_ports {gray_data[6]}]
set_drive 1  [get_ports {gray_data[5]}]
set_drive 1  [get_ports {gray_data[4]}]
set_drive 1  [get_ports {gray_data[3]}]
set_drive 1  [get_ports {gray_data[2]}]
set_drive 1  [get_ports {gray_data[1]}]
set_drive 1  [get_ports {gray_data[0]}]
